# EndPost Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PostPattern..::..EndPost Property
PostPattern Class See Also
---
Accesses the object containing properties related to the end post.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public BalusterInfo EndPost { get; }
```

Visual Basic
---
```text
Public ReadOnly Property EndPost As BalusterInfo
	Get
```

Visual C++
---
```text
public:
property BalusterInfo^ EndPost {
	BalusterInfo^ get ();
}
```

# See Also
PostPattern Class
Autodesk.Revit.DB.Architecture Namespace